## Import libraries and Read Data

In [1]:
import pandas as pd

In [3]:
data = pd.read_csv("titanic.csv")
data.head(5)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

## Display column Sex and Survived

In [4]:
data[["Sex","Survived"]]

        Sex  Survived
0      male         0
1    female         1
2    female         1
3    female         1
4      male         0
..      ...       ...
886    male         0
887  female         1
888  female         0
889    male         1
890    male         0

[891 rows x 2 columns]

In [6]:
people_sur = data[data.Survived == 1].Survived.count()
print(people_sur)

342

In [7]:
not_sur = data[data.Survived == 0].Survived.count()
print(not_sur)

549

In [8]:
len(data[(data['Survived']==1)&(data['Sex']=='female')])/len(data[data.Sex=='female'])

0.7420382165605095